[NoCoverage] BlockStatement
src/api/controller/auth.controller.ts:8:69
 import authService from '../service/auth.service';
 
 const authController = {
-  loginWithEmailAndPassword: async (req: Request, res: Response) => {
-    try {
-      const { data, statusCode, message } = await authService.loginWithEmailAndPassword(req.body as TLocalLoginPayload);
-      sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
-    } catch (error) {
-      const errorObject = catchError(error);
-      res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });
-    }
-  },
+  loginWithEmailAndPassword: async (req: Request, res: Response) => {},
   register: tryCatchWrapper(async (req: Request) => await authService.register(req.body as TRegisterPayload)),
   refreshToken: async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/api/controller/auth.controller.ts:9:9
 
 const authController = {
   loginWithEmailAndPassword: async (req: Request, res: Response) => {
-    try {
-      const { data, statusCode, message } = await authService.loginWithEmailAndPassword(req.body as TLocalLoginPayload);
-      sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
-    } catch (error) {
+    try {} catch (error) {
       const errorObject = catchError(error);
       res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });

[NoCoverage] ObjectLiteral
src/api/controller/auth.controller.ts:11:65
   loginWithEmailAndPassword: async (req: Request, res: Response) => {
     try {
       const { data, statusCode, message } = await authService.loginWithEmailAndPassword(req.body as TLocalLoginPayload);
-      sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
+      sendAuthCookieToClient(res, data).status(statusCode).json({});
     } catch (error) {
       const errorObject = catchError(error);

[NoCoverage] BlockStatement
src/api/controller/auth.controller.ts:12:21
     try {
       const { data, statusCode, message } = await authService.loginWithEmailAndPassword(req.body as TLocalLoginPayload);
       sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
-    } catch (error) {
-      const errorObject = catchError(error);
-      res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });
-    }
+    } catch (error) {}
   },
   register: tryCatchWrapper(async (req: Request) => await authService.register(req.body as TRegisterPayload)),

[Killed] ArrowFunction
src/api/controller/auth.controller.ts:17:29
       res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });
     }
   },
-  register: tryCatchWrapper(async (req: Request) => await authService.register(req.body as TRegisterPayload)),
+  register: tryCatchWrapper(() => undefined),
   refreshToken: async (req: Request, res: Response) => {
     try {
killedBy: /auth POST /register should return 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[NoCoverage] BlockStatement
src/api/controller/auth.controller.ts:18:56
     }
   },
   register: tryCatchWrapper(async (req: Request) => await authService.register(req.body as TRegisterPayload)),
-  refreshToken: async (req: Request, res: Response) => {
-    try {
-      const { data, statusCode, message } = await authService.refreshToken(req);
-      sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
-    } catch (error) {
-      const errorObject = catchError(error);
-      res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });
-    }
-  },
+  refreshToken: async (req: Request, res: Response) => {},
 };
 

[NoCoverage] BlockStatement
src/api/controller/auth.controller.ts:19:9
   },
   register: tryCatchWrapper(async (req: Request) => await authService.register(req.body as TRegisterPayload)),
   refreshToken: async (req: Request, res: Response) => {
-    try {
-      const { data, statusCode, message } = await authService.refreshToken(req);
-      sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
-    } catch (error) {
+    try {} catch (error) {
       const errorObject = catchError(error);
       res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });

[NoCoverage] ObjectLiteral
src/api/controller/auth.controller.ts:21:65
   refreshToken: async (req: Request, res: Response) => {
     try {
       const { data, statusCode, message } = await authService.refreshToken(req);
-      sendAuthCookieToClient(res, data).status(statusCode).json({ data: null, message: message });
+      sendAuthCookieToClient(res, data).status(statusCode).json({});
     } catch (error) {
       const errorObject = catchError(error);
