[Killed] ObjectLiteral
src/api/service/user.service.ts:7:21
 import { TServiceResponseType } from '../../types/general.types';
 import { TUserSchema } from '../../types/schema/user.schema.types';
 
-const userService = {
-  createUser: async (req: TUserSchema): Promise<TServiceResponseType<TUserSchema | null>> => {
-    const user = await UserModel.create(req);
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
-  },
-  getUserById: async (req: TGetUserDetailByIdParam): Promise<TServiceResponseType<TUserSchema | null>> => {
-    const user = await UserModel.findById({ _id: req.userId });
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
-  },
-  getUserByEmail: async (req: TGetUserDetailByEmail): Promise<TServiceResponseType<TUserSchema[] | null>> => {
-    const user = await UserModel.find({ email: req.email });
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
-  },
-};
+const userService = {};
 
 export default userService;
killedBy: /auth POST /register should return 200
statusReason: Error: Property `createUser` does not exist in the provided object

[NoCoverage] BlockStatement
src/api/service/user.service.ts:8:94
 import { TUserSchema } from '../../types/schema/user.schema.types';
 
 const userService = {
-  createUser: async (req: TUserSchema): Promise<TServiceResponseType<TUserSchema | null>> => {
-    const user = await UserModel.create(req);
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
-  },
+  createUser: async (req: TUserSchema): Promise<TServiceResponseType<TUserSchema | null>> => {},
   getUserById: async (req: TGetUserDetailByIdParam): Promise<TServiceResponseType<TUserSchema | null>> => {
     const user = await UserModel.findById({ _id: req.userId });

[NoCoverage] ObjectLiteral
src/api/service/user.service.ts:10:12
 const userService = {
   createUser: async (req: TUserSchema): Promise<TServiceResponseType<TUserSchema | null>> => {
     const user = await UserModel.create(req);
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
+    return {};
   },
   getUserById: async (req: TGetUserDetailByIdParam): Promise<TServiceResponseType<TUserSchema | null>> => {

[NoCoverage] BlockStatement
src/api/service/user.service.ts:15:107
       statusCode: EHttpStatus.OK,
     };
   },
-  getUserById: async (req: TGetUserDetailByIdParam): Promise<TServiceResponseType<TUserSchema | null>> => {
-    const user = await UserModel.findById({ _id: req.userId });
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
-  },
+  getUserById: async (req: TGetUserDetailByIdParam): Promise<TServiceResponseType<TUserSchema | null>> => {},
   getUserByEmail: async (req: TGetUserDetailByEmail): Promise<TServiceResponseType<TUserSchema[] | null>> => {
     const user = await UserModel.find({ email: req.email });

[NoCoverage] ObjectLiteral
src/api/service/user.service.ts:17:12
   },
   getUserById: async (req: TGetUserDetailByIdParam): Promise<TServiceResponseType<TUserSchema | null>> => {
     const user = await UserModel.findById({ _id: req.userId });
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
+    return {};
   },
   getUserByEmail: async (req: TGetUserDetailByEmail): Promise<TServiceResponseType<TUserSchema[] | null>> => {

[NoCoverage] BlockStatement
src/api/service/user.service.ts:22:110
       statusCode: EHttpStatus.OK,
     };
   },
-  getUserByEmail: async (req: TGetUserDetailByEmail): Promise<TServiceResponseType<TUserSchema[] | null>> => {
-    const user = await UserModel.find({ email: req.email });
-    return {
-      data: user,
-      statusCode: EHttpStatus.OK,
-    };
-  },
+  getUserByEmail: async (req: TGetUserDetailByEmail): Promise<TServiceResponseType<TUserSchema[] | null>> => {},
 };
 
