[NoCoverage] BooleanLiteral
src/api/service/auth.service.ts:24:9
       throw new AppError(EHttpStatus.BAD_REQUEST, 'Wrong email');
     }
 
-    if (!bcryptCompareSync(reqBody.password, user?.password)) {
+    if (bcryptCompareSync(reqBody.password, user?.password)) {
       throw new AppError(EHttpStatus.BAD_REQUEST, 'Wrong password');
     }

[NoCoverage] ConditionalExpression
src/api/service/auth.service.ts:24:9
       throw new AppError(EHttpStatus.BAD_REQUEST, 'Wrong email');
     }
 
-    if (!bcryptCompareSync(reqBody.password, user?.password)) {
+    if (false) {
       throw new AppError(EHttpStatus.BAD_REQUEST, 'Wrong password');
     }

[NoCoverage] ObjectLiteral
src/api/service/auth.service.ts:28:22
       throw new AppError(EHttpStatus.BAD_REQUEST, 'Wrong password');
     }
 
-    const userData = {
-      id: user._id.toString(),
-      email: user.email,
-      fullName: user.fullName,
-    };
+    const userData = {};
 
     const token = signJWT(userData);

[NoCoverage] ObjectLiteral
src/api/service/auth.service.ts:46:13
     });
 
     return {
-      data: {
-        token,
-        refreshToken,
-      },
+      data: {},
       statusCode: EHttpStatus.OK,
       message: 'Login successfully',

[Killed] BlockStatement
src/api/service/auth.service.ts:54:81
       message: 'Login successfully',
     };
   },
-  register: async (reqBody: TRegisterPayload): Promise<TServiceResponseType> => {
-    reqBody.password = bcryptHashSync(reqBody.password);
-    await userService.createUser(reqBody);
-
-    return {
-      data: null,
-      statusCode: EHttpStatus.OK,
-      message: 'Register successfully',
-    };
-  },
+  register: async (reqBody: TRegisterPayload): Promise<TServiceResponseType> => {},
   refreshToken: async (
     req: Request,
killedBy: /auth POST /register should return 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[NoCoverage] StringLiteral
src/api/service/auth.service.ts:67:37
   refreshToken: async (
     req: Request,
   ): Promise<TServiceResponseType<{ token: ReturnJWTType; refreshToken: ReturnJWTType }>> => {
-    const refresToken = req.cookies['refreshToken'];
+    const refresToken = req.cookies[""];
     const secretKey = process.env.REFRESH_SECRET_KEY;
 

[NoCoverage] ConditionalExpression
src/api/service/auth.service.ts:70:9
     const refresToken = req.cookies['refreshToken'];
     const secretKey = process.env.REFRESH_SECRET_KEY;
 
-    if (!secretKey) throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Cannot read .env');
+    if (false) throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Cannot read .env');
 
     const verifiedRefreshToken = jsonwebtoken.verify(refresToken, secretKey, {

[NoCoverage] BooleanLiteral
src/api/service/auth.service.ts:70:9
     const refresToken = req.cookies['refreshToken'];
     const secretKey = process.env.REFRESH_SECRET_KEY;
 
-    if (!secretKey) throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Cannot read .env');
+    if (secretKey) throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Cannot read .env');
 
     const verifiedRefreshToken = jsonwebtoken.verify(refresToken, secretKey, {

[NoCoverage] ObjectLiteral
src/api/service/auth.service.ts:82:40
       fullName: verifiedRefreshToken.fullName,
     };
 
-    await RefreshTokenModel.deleteMany({ userId: new mongoose.Types.ObjectId(userData.id)._id });
+    await RefreshTokenModel.deleteMany({});
 
     const token = signJWT(userData);
