[Timeout] BlockStatement
src/common/catchError.ts:9:62
 
 const tryCatchWrapper =
   <T>(promise: (req: Request, res: Response, next: NextFunction) => Promise<TServiceResponseType<T>>) =>
-  async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const result = await promise(req, res, next);
-      res.status(result.statusCode).json({ data: result.data, message: result.message });
-    } catch (error) {
-      const errorObject = catchError(error);
-      res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });
-    }
-  };
+  async (req: Request, res: Response, next: NextFunction) => {};
 
 const catchError = (error: unknown) => {

[Timeout] BlockStatement
src/common/catchError.ts:10:9
 const tryCatchWrapper =
   <T>(promise: (req: Request, res: Response, next: NextFunction) => Promise<TServiceResponseType<T>>) =>
   async (req: Request, res: Response, next: NextFunction) => {
-    try {
-      const result = await promise(req, res, next);
-      res.status(result.statusCode).json({ data: result.data, message: result.message });
-    } catch (error) {
+    try {} catch (error) {
       const errorObject = catchError(error);
       res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });

[NoCoverage] BlockStatement
src/common/catchError.ts:13:21
     try {
       const result = await promise(req, res, next);
       res.status(result.statusCode).json({ data: result.data, message: result.message });
-    } catch (error) {
-      const errorObject = catchError(error);
-      res.status(errorObject.statusCode).json({ data: errorObject.data, message: errorObject.message });
-    }
+    } catch (error) {}
   };
 

[NoCoverage] BlockStatement
src/common/catchError.ts:19:40
     }
   };
 
-const catchError = (error: unknown) => {
-  if (error instanceof AppError) {
-    return {
-      data: null,
-      message: error.message,
-      statusCode: error.statusCode,
-    };
-  }
-
-  if (error instanceof mongoose.Error.ValidationError || error instanceof mongoose.mongo.MongoError) {
-    return {
-      data: null,
-      statusCode: EHttpStatus.BAD_REQUEST,
-      message: error.message,
-    };
-  }
-
-  return {
-    data: null,
-    statusCode: EHttpStatus.INTERNAL_SERVER_ERROR,
-    message: (error as { message: string; [key: string]: unknown })?.message ?? null,
-  };
-};
+const catchError = (error: unknown) => {};
 
 export { catchError, tryCatchWrapper };

[NoCoverage] ConditionalExpression
src/common/catchError.ts:20:7
   };
 
 const catchError = (error: unknown) => {
-  if (error instanceof AppError) {
+  if (false) {
     return {
       data: null,

[NoCoverage] BlockStatement
src/common/catchError.ts:20:34
   };
 
 const catchError = (error: unknown) => {
-  if (error instanceof AppError) {
-    return {
-      data: null,
-      message: error.message,
-      statusCode: error.statusCode,
-    };
-  }
+  if (error instanceof AppError) {}
 
   if (error instanceof mongoose.Error.ValidationError || error instanceof mongoose.mongo.MongoError) {

[NoCoverage] ObjectLiteral
src/common/catchError.ts:21:12
 
 const catchError = (error: unknown) => {
   if (error instanceof AppError) {
-    return {
-      data: null,
-      message: error.message,
-      statusCode: error.statusCode,
-    };
+    return {};
   }
 

[NoCoverage] ConditionalExpression
src/common/catchError.ts:28:7
     };
   }
 
-  if (error instanceof mongoose.Error.ValidationError || error instanceof mongoose.mongo.MongoError) {
+  if (true) {
     return {
       data: null,

[NoCoverage] LogicalOperator
src/common/catchError.ts:28:7
     };
   }
 
-  if (error instanceof mongoose.Error.ValidationError || error instanceof mongoose.mongo.MongoError) {
+  if (error instanceof mongoose.Error.ValidationError && error instanceof mongoose.mongo.MongoError) {
     return {
       data: null,

[NoCoverage] ObjectLiteral
src/common/catchError.ts:29:12
   }
 
   if (error instanceof mongoose.Error.ValidationError || error instanceof mongoose.mongo.MongoError) {
-    return {
-      data: null,
-      statusCode: EHttpStatus.BAD_REQUEST,
-      message: error.message,
-    };
+    return {};
   }
 

[NoCoverage] LogicalOperator
src/common/catchError.ts:39:14
   return {
     data: null,
     statusCode: EHttpStatus.INTERNAL_SERVER_ERROR,
-    message: (error as { message: string; [key: string]: unknown })?.message ?? null,
+    message: (error as {
+  message: string;
+  [key: string]: unknown;
+})?.message && null,
   };
 };

[NoCoverage] OptionalChaining
src/common/catchError.ts:39:14
   return {
     data: null,
     statusCode: EHttpStatus.INTERNAL_SERVER_ERROR,
-    message: (error as { message: string; [key: string]: unknown })?.message ?? null,
+    message: (error as {
+  message: string;
+  [key: string]: unknown;
+}).message ?? null,
   };
 };
