[Survived] ArrowFunction
src/api/validator/auth.validator.ts:6:59
 import { localLoginDTO, refreshTokenDTO, registerDTO } from '../DTO/auth.dto';
 
 const authValidator = {
-  validateLocalLogin: validateWrapper<TLocalLoginPayload>((req) => localLoginDTO.validate(req.body)),
+  validateLocalLogin: validateWrapper<TLocalLoginPayload>(() => undefined),
   validateRegister: validateWrapper<TRegisterPayload>((req) => registerDTO.validate(req.body)),
   validateRefreshToken: validateWrapper<TRefreshJWTPayload>((req) =>

[Survived] ArrowFunction
src/api/validator/auth.validator.ts:7:55
 
 const authValidator = {
   validateLocalLogin: validateWrapper<TLocalLoginPayload>((req) => localLoginDTO.validate(req.body)),
-  validateRegister: validateWrapper<TRegisterPayload>((req) => registerDTO.validate(req.body)),
+  validateRegister: validateWrapper<TRegisterPayload>(() => undefined),
   validateRefreshToken: validateWrapper<TRefreshJWTPayload>((req) =>
     refreshTokenDTO.validate({ refreshToken: req.cookies['refreshToken'] }),

[Survived] ArrowFunction
src/api/validator/auth.validator.ts:8:61
 const authValidator = {
   validateLocalLogin: validateWrapper<TLocalLoginPayload>((req) => localLoginDTO.validate(req.body)),
   validateRegister: validateWrapper<TRegisterPayload>((req) => registerDTO.validate(req.body)),
-  validateRefreshToken: validateWrapper<TRefreshJWTPayload>((req) =>
-    refreshTokenDTO.validate({ refreshToken: req.cookies['refreshToken'] }),
+  validateRefreshToken: validateWrapper<TRefreshJWTPayload>(() => undefined,
   ),
 };
