[Survived] ArrowFunction
src/common/cookies.ts:5:42
 import { EAuthCookiesKey } from '../config/constant';
 import { ReturnJWTType } from './signJWT';
 
-export const sendToClientCookieOptions = (expires: string): CookieOptions => ({
-  maxAge: parseInt(expires) * 1000, //convert from seconds to milliseconds
-  httpOnly: true,
-  sameSite: 'none',
-  secure: true,
-});
+export const sendToClientCookieOptions = () => undefined;
 
 export const sendAuthCookieToClient = (

[NoCoverage] ArithmeticOperator
src/common/cookies.ts:6:11
 import { ReturnJWTType } from './signJWT';
 
 export const sendToClientCookieOptions = (expires: string): CookieOptions => ({
-  maxAge: parseInt(expires) * 1000, //convert from seconds to milliseconds
+  maxAge: parseInt(expires) / 1000, //convert from seconds to milliseconds
   httpOnly: true,
   sameSite: 'none',

[NoCoverage] BooleanLiteral
src/common/cookies.ts:7:13
 
 export const sendToClientCookieOptions = (expires: string): CookieOptions => ({
   maxAge: parseInt(expires) * 1000, //convert from seconds to milliseconds
-  httpOnly: true,
+  httpOnly: false,
   sameSite: 'none',
   secure: true,

[NoCoverage] BooleanLiteral
src/common/cookies.ts:9:11
   maxAge: parseInt(expires) * 1000, //convert from seconds to milliseconds
   httpOnly: true,
   sameSite: 'none',
-  secure: true,
+  secure: false,
 });
 

[NoCoverage] BlockStatement
src/common/cookies.ts:15:6
 export const sendAuthCookieToClient = (
   res: Response,
   authCredentials: { token: ReturnJWTType; refreshToken: ReturnJWTType },
-) => {
-  const { token, refreshToken } = authCredentials;
-  res
-    .cookie(EAuthCookiesKey.Token, token, sendToClientCookieOptions(token.expires))
-    .cookie(EAuthCookiesKey.RefreshToken, refreshToken.token, sendToClientCookieOptions(refreshToken.expires));
-  return res;
-};
+) => {};
 
