[Killed] BlockStatement
src/common/bcrypt.ts:3:42
 import bcrypt from 'bcrypt';
 
-const bcryptHashSync = (data: string) => {
-  const saltRounds = 10;
-  return bcrypt.hashSync(data, saltRounds);
-};
+const bcryptHashSync = (data: string) => {};
 
 const bcryptCompareSync = (plainData: string, hashData: string) => {
killedBy: /auth POST /register should return 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "email": "tester.001@company.com",
    "fullName": "Tester 001",

[NoCoverage] BlockStatement
src/common/bcrypt.ts:8:68
   return bcrypt.hashSync(data, saltRounds);
 };
 
-const bcryptCompareSync = (plainData: string, hashData: string) => {
-  return bcrypt.compareSync(plainData, hashData);
-};
+const bcryptCompareSync = (plainData: string, hashData: string) => {};
 
 export { bcryptCompareSync, bcryptHashSync };
