[NoCoverage] BlockStatement
src/common/signJWT.ts:12:58
   expires: string;
 };
 
-const signJWT = (payload: TJWTPayload): ReturnJWTType => {
-  const expiresIn = process.env.JWT_EXPIRED;
-  const secretKey = process.env.SECRET_KEY;
-
-  if (expiresIn && secretKey) {
-    const signedToken = jsonWebToken.sign(payload, secretKey, {
-      expiresIn: parseInt(expiresIn),
-      algorithm: JWTAlgorithm,
-    });
-
-    return {
-      token: signedToken,
-      expires: expiresIn,
-    };
-  }
-
-  throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Can not read .env');
-};
+const signJWT = (payload: TJWTPayload): ReturnJWTType => {};
 
 const signRefreshJWT = (payload: TJWTPayload): ReturnJWTType => {

[NoCoverage] LogicalOperator
src/common/signJWT.ts:16:7
   const expiresIn = process.env.JWT_EXPIRED;
   const secretKey = process.env.SECRET_KEY;
 
-  if (expiresIn && secretKey) {
+  if (expiresIn || secretKey) {
     const signedToken = jsonWebToken.sign(payload, secretKey, {
       expiresIn: parseInt(expiresIn),

[NoCoverage] ConditionalExpression
src/common/signJWT.ts:16:7
   const expiresIn = process.env.JWT_EXPIRED;
   const secretKey = process.env.SECRET_KEY;
 
-  if (expiresIn && secretKey) {
+  if (true) {
     const signedToken = jsonWebToken.sign(payload, secretKey, {
       expiresIn: parseInt(expiresIn),

[NoCoverage] BlockStatement
src/common/signJWT.ts:31:65
   throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Can not read .env');
 };
 
-const signRefreshJWT = (payload: TJWTPayload): ReturnJWTType => {
-  const expiresIn = process.env.REFRESH_JWT_EXPIRED;
-  const secretKey = process.env.REFRESH_SECRET_KEY;
-
-  if (expiresIn && secretKey) {
-    const signedToken = jsonWebToken.sign(payload, secretKey, {
-      expiresIn: parseInt(expiresIn),
-      algorithm: JWTAlgorithm,
-    });
-
-    return {
-      token: signedToken,
-      expires: expiresIn,
-    };
-  }
-
-  throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Can not read .env');
-};
+const signRefreshJWT = (payload: TJWTPayload): ReturnJWTType => {};
 
 export { signJWT, signRefreshJWT };

[NoCoverage] BlockStatement
src/common/signJWT.ts:35:31
   const expiresIn = process.env.REFRESH_JWT_EXPIRED;
   const secretKey = process.env.REFRESH_SECRET_KEY;
 
-  if (expiresIn && secretKey) {
-    const signedToken = jsonWebToken.sign(payload, secretKey, {
-      expiresIn: parseInt(expiresIn),
-      algorithm: JWTAlgorithm,
-    });
-
-    return {
-      token: signedToken,
-      expires: expiresIn,
-    };
-  }
+  if (expiresIn && secretKey) {}
 
   throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Can not read .env');

[NoCoverage] ObjectLiteral
src/common/signJWT.ts:41:12
       algorithm: JWTAlgorithm,
     });
 
-    return {
-      token: signedToken,
-      expires: expiresIn,
-    };
+    return {};
   }
 

[NoCoverage] StringLiteral
src/common/signJWT.ts:47:57
     };
   }
 
-  throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, 'Can not read .env');
+  throw new AppError(EHttpStatus.INTERNAL_SERVER_ERROR, "");
 };
 
