[Killed] BlockStatement
src/common/validator.ts:7:68
 const validateWrapper = <T>(
   validateCb: (req: Request<unknown, unknown, T>, res: Response, next: NextFunction) => Promise<T>,
 ) =>
-  async function (req: Request, res: Response, next: NextFunction) {
-    try {
-      await validateCb(req, res, next);
-      next();
-    } catch (err) {
-      if (err instanceof ValidationError) {
-        next(err.message);
-        return;
-      }
-      next(err);
-    }
-  };
+  async function (req: Request, res: Response, next: NextFunction) {};
 
 export default validateWrapper;
killedBy: /auth POST /register should return 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/common/validator.ts:8:9
   validateCb: (req: Request<unknown, unknown, T>, res: Response, next: NextFunction) => Promise<T>,
 ) =>
   async function (req: Request, res: Response, next: NextFunction) {
-    try {
-      await validateCb(req, res, next);
-      next();
-    } catch (err) {
+    try {} catch (err) {
       if (err instanceof ValidationError) {
         next(err.message);
killedBy: /auth POST /register should return 200
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[NoCoverage] BlockStatement
src/common/validator.ts:11:19
     try {
       await validateCb(req, res, next);
       next();
-    } catch (err) {
-      if (err instanceof ValidationError) {
-        next(err.message);
-        return;
-      }
-      next(err);
-    }
+    } catch (err) {}
   };
 

[NoCoverage] BlockStatement
src/common/validator.ts:12:43
       await validateCb(req, res, next);
       next();
     } catch (err) {
-      if (err instanceof ValidationError) {
-        next(err.message);
-        return;
-      }
+      if (err instanceof ValidationError) {}
       next(err);
     }

[NoCoverage] ConditionalExpression
src/common/validator.ts:12:11
       await validateCb(req, res, next);
       next();
     } catch (err) {
-      if (err instanceof ValidationError) {
+      if (false) {
         next(err.message);
         return;
