[NoCoverage] BlockStatement
src/middleware/auth.ts:8:85
 import { EHttpStatus } from '../constant/statusCode';
 import { TUserSchema } from '../types/schema/user.schema.types';
 
-const authenticateMiddleware = (req: Request, res: Response, next: NextFunction) => {
-  passport.use(generateJWTStrategy());
-  passport.authenticate('jwt', { session: false }, (err: Error, user: TUserSchema) => {
-    if (err) {
-      return next(err);
-    }
-    if (!user) {
-      return next(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'));
-    }
-    return next();
-  })(req, res, next);
-};
+const authenticateMiddleware = (req: Request, res: Response, next: NextFunction) => {};
 
 export default authenticateMiddleware;

[NoCoverage] BlockStatement
src/middleware/auth.ts:10:87
 
 const authenticateMiddleware = (req: Request, res: Response, next: NextFunction) => {
   passport.use(generateJWTStrategy());
-  passport.authenticate('jwt', { session: false }, (err: Error, user: TUserSchema) => {
-    if (err) {
-      return next(err);
-    }
-    if (!user) {
-      return next(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'));
-    }
-    return next();
-  })(req, res, next);
+  passport.authenticate('jwt', { session: false }, (err: Error, user: TUserSchema) => {})(req, res, next);
 };
 

[NoCoverage] BooleanLiteral
src/middleware/auth.ts:10:43
 
 const authenticateMiddleware = (req: Request, res: Response, next: NextFunction) => {
   passport.use(generateJWTStrategy());
-  passport.authenticate('jwt', { session: false }, (err: Error, user: TUserSchema) => {
+  passport.authenticate('jwt', { session: true }, (err: Error, user: TUserSchema) => {
     if (err) {
       return next(err);

[NoCoverage] BlockStatement
src/middleware/auth.ts:11:14
 const authenticateMiddleware = (req: Request, res: Response, next: NextFunction) => {
   passport.use(generateJWTStrategy());
   passport.authenticate('jwt', { session: false }, (err: Error, user: TUserSchema) => {
-    if (err) {
-      return next(err);
-    }
+    if (err) {}
     if (!user) {
       return next(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'));

[NoCoverage] ConditionalExpression
src/middleware/auth.ts:11:9
 const authenticateMiddleware = (req: Request, res: Response, next: NextFunction) => {
   passport.use(generateJWTStrategy());
   passport.authenticate('jwt', { session: false }, (err: Error, user: TUserSchema) => {
-    if (err) {
+    if (true) {
       return next(err);
     }

[NoCoverage] BlockStatement
src/middleware/auth.ts:14:16
     if (err) {
       return next(err);
     }
-    if (!user) {
-      return next(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'));
-    }
+    if (!user) {}
     return next();
   })(req, res, next);

[NoCoverage] BooleanLiteral
src/middleware/auth.ts:14:9
     if (err) {
       return next(err);
     }
-    if (!user) {
+    if (user) {
       return next(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'));
     }
