[NoCoverage] BlockStatement
src/config/jwtStrategy.ts:10:35
 import { TJWTVerify } from '../types/api/auth.types';
 import { EAuthCookiesKey, JWTAlgorithm } from './constant';
 
-const generateJWTStrategy = () => {
-  const jwtSecret = process.env.SECRET_KEY;
-
-  return new passportJWT.Strategy(
-    {
-      jwtFromRequest: (req: Request) => {
-        return req.cookies[EAuthCookiesKey.Token];
-      },
-      secretOrKey: jwtSecret,
-      algorithms: [JWTAlgorithm],
-    },
-    async function (jwtPayload: TJWTVerify, done) {
-      try {
-        const user = await UserModel.findById(jwtPayload.id);
-        if (user) {
-          return done(null, jwtPayload);
-        }
-        return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
-      } catch (error) {
-        return done(catchError(error), false);
-      }
-    },
-  );
-};
+const generateJWTStrategy = () => {};
 
 export default generateJWTStrategy;

[NoCoverage] BlockStatement
src/config/jwtStrategy.ts:15:41
 
   return new passportJWT.Strategy(
     {
-      jwtFromRequest: (req: Request) => {
-        return req.cookies[EAuthCookiesKey.Token];
-      },
+      jwtFromRequest: (req: Request) => {},
       secretOrKey: jwtSecret,
       algorithms: [JWTAlgorithm],

[NoCoverage] BlockStatement
src/config/jwtStrategy.ts:21:51
       secretOrKey: jwtSecret,
       algorithms: [JWTAlgorithm],
     },
-    async function (jwtPayload: TJWTVerify, done) {
-      try {
-        const user = await UserModel.findById(jwtPayload.id);
-        if (user) {
-          return done(null, jwtPayload);
-        }
-        return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
-      } catch (error) {
-        return done(catchError(error), false);
-      }
-    },
+    async function (jwtPayload: TJWTVerify, done) {},
   );
 };

[NoCoverage] BlockStatement
src/config/jwtStrategy.ts:22:11
       algorithms: [JWTAlgorithm],
     },
     async function (jwtPayload: TJWTVerify, done) {
-      try {
-        const user = await UserModel.findById(jwtPayload.id);
-        if (user) {
-          return done(null, jwtPayload);
-        }
-        return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
-      } catch (error) {
+      try {} catch (error) {
         return done(catchError(error), false);
       }

[NoCoverage] ConditionalExpression
src/config/jwtStrategy.ts:24:13
     async function (jwtPayload: TJWTVerify, done) {
       try {
         const user = await UserModel.findById(jwtPayload.id);
-        if (user) {
+        if (true) {
           return done(null, jwtPayload);
         }

[NoCoverage] BlockStatement
src/config/jwtStrategy.ts:24:19
     async function (jwtPayload: TJWTVerify, done) {
       try {
         const user = await UserModel.findById(jwtPayload.id);
-        if (user) {
-          return done(null, jwtPayload);
-        }
+        if (user) {}
         return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
       } catch (error) {

[NoCoverage] BooleanLiteral
src/config/jwtStrategy.ts:27:85
         if (user) {
           return done(null, jwtPayload);
         }
-        return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
+        return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), true);
       } catch (error) {
         return done(catchError(error), false);

[NoCoverage] BlockStatement
src/config/jwtStrategy.ts:28:23
           return done(null, jwtPayload);
         }
         return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
-      } catch (error) {
-        return done(catchError(error), false);
-      }
+      } catch (error) {}
     },
   );

[NoCoverage] BooleanLiteral
src/config/jwtStrategy.ts:29:40
         }
         return done(new AppError(EHttpStatus.UNAUTHORIZED, 'Invalid Credentials.'), false);
       } catch (error) {
-        return done(catchError(error), false);
+        return done(catchError(error), true);
       }
     },
