[Survived] MethodExpression
src/api/DTO/auth.dto.ts:6:10
 import { TLocalLoginPayload, TRefreshJWTPayload, TRegisterPayload } from '../../types/api/auth.types';
 
 const localLoginDTO: ObjectSchema<TLocalLoginPayload> = object({
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
+  email: string().required().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
 });

[Survived] ObjectLiteral
src/api/DTO/auth.dto.ts:7:64
 
 const localLoginDTO: ObjectSchema<TLocalLoginPayload> = object({
   email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
-  password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
+  password: string().required().trim().matches(PASSWORD_REGEX, {}),
 });
 

[Survived] ObjectLiteral
src/api/DTO/auth.dto.ts:10:60
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
 });
 
-const registerDTO: ObjectSchema<TRegisterPayload> = object({
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
-  password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
-  fullName: string().required().trim(),
-});
+const registerDTO: ObjectSchema<TRegisterPayload> = object({});
 
 const refreshTokenDTO: ObjectSchema<TRefreshJWTPayload> = object({

[Survived] MethodExpression
src/api/DTO/auth.dto.ts:11:10
 });
 
 const registerDTO: ObjectSchema<TRegisterPayload> = object({
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
+  email: string().required().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
   fullName: string().required().trim(),

[Survived] ObjectLiteral
src/api/DTO/auth.dto.ts:11:58
 });
 
 const registerDTO: ObjectSchema<TRegisterPayload> = object({
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
+  email: string().required().trim().matches(EMAIL_REGEX, {}),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
   fullName: string().required().trim(),

[Survived] MethodExpression
src/api/DTO/auth.dto.ts:13:13
 const registerDTO: ObjectSchema<TRegisterPayload> = object({
   email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
-  fullName: string().required().trim(),
+  fullName: string().required(),
 });
 

[Survived] ObjectLiteral
src/api/DTO/auth.dto.ts:16:66
   fullName: string().required().trim(),
 });
 
-const refreshTokenDTO: ObjectSchema<TRefreshJWTPayload> = object({
-  refreshToken: string().required().trim(),
-});
+const refreshTokenDTO: ObjectSchema<TRefreshJWTPayload> = object({});
 
 export { localLoginDTO, refreshTokenDTO, registerDTO };

[Survived] MethodExpression
src/api/DTO/auth.dto.ts:17:17
 });
 
 const refreshTokenDTO: ObjectSchema<TRefreshJWTPayload> = object({
-  refreshToken: string().required().trim(),
+  refreshToken: string().required(),
 });
 
