[Survived] StringLiteral
src/api/routes/auth.routes.ts:6:16
 import authValidator from '../validator/auth.validator';
 
 const authRoute = express.Router();
-authRoute.post('/login', authValidator.validateLocalLogin, authController.loginWithEmailAndPassword);
+authRoute.post("", authValidator.validateLocalLogin, authController.loginWithEmailAndPassword);
 authRoute.post('/register', authValidator.validateRegister, authController.register);
 authRoute.post('/refreshToken', authValidator.validateRefreshToken, authController.refreshToken);
