[NoCoverage] BlockStatement
src/constant/error.ts:6:57
 class AppError extends Error {
   statusCode: EHttpStatus;
 
-  constructor(statusCode: EHttpStatus, message: string) {
-    super();
-
-    this.statusCode = statusCode;
-    this.message = message;
-  }
+  constructor(statusCode: EHttpStatus, message: string) {}
 }
 
