[NoCoverage] BlockStatement
src/index.ts:8:24
 const port = process.env.PORT;
 
 const app = appLoader();
-app.listen(port, () => {
-  console.log(`⚡️[server]: Server is running at http://localhost:${port}`);
-});
+app.listen(port, () => {});
 
 export default app;
