[Survived] BooleanLiteral
src/model/refreshToken.ts:14:15
   },
   userId: {
     type: Types.ObjectId,
-    required: true,
+    required: false,
     trim: true,
   },

[Survived] BooleanLiteral
src/model/refreshToken.ts:19:15
   },
   expiredAt: {
     type: Date,
-    required: true,
+    required: false,
   },
 });

[Survived] StringLiteral
src/model/refreshToken.ts:23:63
   },
 });
 
-const RefreshTokenModel = mongoose.model<TRefreshTokenSchema>('RefreshToken', refreshTokenSchema, 'RefreshToken');
+const RefreshTokenModel = mongoose.model<TRefreshTokenSchema>("", refreshTokenSchema, 'RefreshToken');
 
 export default RefreshTokenModel;
