[Killed] BlockStatement
src/loader/index.ts:7:50
 import mongooseLoader from './mongooes';
 import passportLoader from './passport';
 
-const appLoader = (connectDB: boolean = true) => {
-  const app: Express = express();
-
-  loggerLoader(app);
-  connectDB && mongooseLoader(app);
-  passportLoader(app);
-
-  //last
-  expressLoader(app);
-
-  return app;
-};
+const appLoader = (connectDB: boolean = true) => {};
 
 export default appLoader;
killedBy: /auth POST /register should return 200
statusReason: TypeError: Cannot read properties of undefined (reading 'address')

[NoCoverage] BooleanLiteral
src/loader/index.ts:7:41
 import mongooseLoader from './mongooes';
 import passportLoader from './passport';
 
-const appLoader = (connectDB: boolean = true) => {
+const appLoader = (connectDB: boolean = false) => {
   const app: Express = express();
 

[Survived] LogicalOperator
src/loader/index.ts:11:3
   const app: Express = express();
 
   loggerLoader(app);
-  connectDB && mongooseLoader(app);
+  connectDB || mongooseLoader(app);
   passportLoader(app);
 

[Survived] ConditionalExpression
src/loader/index.ts:11:3
   const app: Express = express();
 
   loggerLoader(app);
-  connectDB && mongooseLoader(app);
+  true;
   passportLoader(app);
 
