[NoCoverage] BlockStatement
src/loader/mongooes.ts:5:48
 import mongoSanitize from 'express-mongo-sanitize';
 import mongoose from 'mongoose';
 
-const mongooseLoader = async (app: Express) => {
-  const MONGODB_CONNECT_STRING = process.env.MONGODB_CONNECT_STRING;
-  const MONGODB_PASSWORD = process.env.MONGODB_PASSWORD;
-
-  try {
-    if (MONGODB_CONNECT_STRING && MONGODB_PASSWORD)
-      await mongoose.connect(MONGODB_CONNECT_STRING.replace('<password>', MONGODB_PASSWORD));
-    app.use(mongoSanitize());
-    console.log('Connected MongoDB successfully');
-  } catch (error) {
-    console.error(error);
-  }
-
-  return app;
-};
+const mongooseLoader = async (app: Express) => {};
 
 export default mongooseLoader;

[NoCoverage] BlockStatement
src/loader/mongooes.ts:9:7
   const MONGODB_CONNECT_STRING = process.env.MONGODB_CONNECT_STRING;
   const MONGODB_PASSWORD = process.env.MONGODB_PASSWORD;
 
-  try {
-    if (MONGODB_CONNECT_STRING && MONGODB_PASSWORD)
-      await mongoose.connect(MONGODB_CONNECT_STRING.replace('<password>', MONGODB_PASSWORD));
-    app.use(mongoSanitize());
-    console.log('Connected MongoDB successfully');
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
   }

[NoCoverage] ConditionalExpression
src/loader/mongooes.ts:10:9
   const MONGODB_PASSWORD = process.env.MONGODB_PASSWORD;
 
   try {
-    if (MONGODB_CONNECT_STRING && MONGODB_PASSWORD)
+    if (false)
       await mongoose.connect(MONGODB_CONNECT_STRING.replace('<password>', MONGODB_PASSWORD));
     app.use(mongoSanitize());

[NoCoverage] ConditionalExpression
src/loader/mongooes.ts:10:9
   const MONGODB_PASSWORD = process.env.MONGODB_PASSWORD;
 
   try {
-    if (MONGODB_CONNECT_STRING && MONGODB_PASSWORD)
+    if (true)
       await mongoose.connect(MONGODB_CONNECT_STRING.replace('<password>', MONGODB_PASSWORD));
     app.use(mongoSanitize());

[NoCoverage] BlockStatement
src/loader/mongooes.ts:14:19
       await mongoose.connect(MONGODB_CONNECT_STRING.replace('<password>', MONGODB_PASSWORD));
     app.use(mongoSanitize());
     console.log('Connected MongoDB successfully');
-  } catch (error) {
-    console.error(error);
-  }
+  } catch (error) {}
 
   return app;
