[Survived] ArrowFunction
src/api/controller/user.controller.ts:8:31
 import userService from '../service/user.service';
 
 const userController = {
-  createUser: tryCatchWrapper(async (req: Request) => await userService.createUser(req.body as TUserSchema)),
+  createUser: tryCatchWrapper(() => undefined),
   getUserById: tryCatchWrapper(
     async (req: Request) => await userService.getUserById(req.params as TGetUserDetailByIdParam),

[Survived] ArrowFunction
src/api/controller/user.controller.ts:10:5
 const userController = {
   createUser: tryCatchWrapper(async (req: Request) => await userService.createUser(req.body as TUserSchema)),
   getUserById: tryCatchWrapper(
-    async (req: Request) => await userService.getUserById(req.params as TGetUserDetailByIdParam),
+    () => undefined,
   ),
 };
