[Survived] ObjectLiteral
src/api/DTO/user.dto.ts:6:57
 import { TGetUserDetailByEmail, TGetUserDetailByIdParam } from '../../types/api/user.types';
 import { TUserSchema } from '../../types/schema/user.schema.types';
 
-const createUserDTO: ObjectSchema<TUserSchema> = object({
-  fullName: string().required().trim(),
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
-  password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
-  dateOfBirth: date().optional(),
-  avatar: string().optional(),
-});
+const createUserDTO: ObjectSchema<TUserSchema> = object({});
 
 const getUserDetailByIdDTO: ObjectSchema<TGetUserDetailByIdParam> = object({

[Survived] MethodExpression
src/api/DTO/user.dto.ts:7:13
 import { TUserSchema } from '../../types/schema/user.schema.types';
 
 const createUserDTO: ObjectSchema<TUserSchema> = object({
-  fullName: string().required().trim(),
+  fullName: string().required(),
   email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),

[Survived] MethodExpression
src/api/DTO/user.dto.ts:8:10
 
 const createUserDTO: ObjectSchema<TUserSchema> = object({
   fullName: string().required().trim(),
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
+  email: string().required().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
   dateOfBirth: date().optional(),

[Survived] StringLiteral
src/api/DTO/user.dto.ts:8:69
 
 const createUserDTO: ObjectSchema<TUserSchema> = object({
   fullName: string().required().trim(),
-  email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
+  email: string().required().trim().matches(EMAIL_REGEX, { message: "" }),
   password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
   dateOfBirth: date().optional(),

[Survived] MethodExpression
src/api/DTO/user.dto.ts:9:13
 const createUserDTO: ObjectSchema<TUserSchema> = object({
   fullName: string().required().trim(),
   email: string().required().trim().matches(EMAIL_REGEX, { message: 'Email format is invalid' }),
-  password: string().required().trim().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
+  password: string().required().matches(PASSWORD_REGEX, { message: 'Password format is invalid' }),
   dateOfBirth: date().optional(),
   avatar: string().optional(),

[Survived] MethodExpression
src/api/DTO/user.dto.ts:15:11
 });
 
 const getUserDetailByIdDTO: ObjectSchema<TGetUserDetailByIdParam> = object({
-  userId: string().required().trim(),
+  userId: string().required(),
 });
 

[Survived] ObjectLiteral
src/api/DTO/user.dto.ts:18:77
   userId: string().required().trim(),
 });
 
-const getUserDetailByEmailDTO: ObjectSchema<TGetUserDetailByEmail> = object({
-  email: string().required().trim(),
-});
+const getUserDetailByEmailDTO: ObjectSchema<TGetUserDetailByEmail> = object({});
 
 export { createUserDTO, getUserDetailByEmailDTO, getUserDetailByIdDTO };

[Survived] MethodExpression
src/api/DTO/user.dto.ts:19:10
 });
 
 const getUserDetailByEmailDTO: ObjectSchema<TGetUserDetailByEmail> = object({
-  email: string().required().trim(),
+  email: string().required(),
 });
 
