[Survived] ArrowFunction
src/api/validator/user.validator.ts:7:52
 import { createUserDTO, getUserDetailByIdDTO } from '../DTO/user.dto';
 
 const userValidator = {
-  validateCreateUser: validateWrapper<TUserSchema>((req) => createUserDTO.validate(req.body)),
+  validateCreateUser: validateWrapper<TUserSchema>(() => undefined),
   validateGetUserDetailById: validateWrapper<TGetUserDetailByIdParam>((req) =>
     getUserDetailByIdDTO.validate(req.params),

[Survived] ArrowFunction
src/api/validator/user.validator.ts:8:71
 
 const userValidator = {
   validateCreateUser: validateWrapper<TUserSchema>((req) => createUserDTO.validate(req.body)),
-  validateGetUserDetailById: validateWrapper<TGetUserDetailByIdParam>((req) =>
-    getUserDetailByIdDTO.validate(req.params),
+  validateGetUserDetailById: validateWrapper<TGetUserDetailByIdParam>(() => undefined,
   ),
 };
