[Killed] BlockStatement
src/loader/express.ts:7:41
 import helmet from 'helmet';
 import apiRoute from '../api/index.routes';
 
-const expressLoader = (app: Express) => {
-  app.use(express.json());
-  app.use(helmet());
-  app.use(cookieParser());
-  app.use(
-    cors({
-      credentials: true,
-      origin: [/^http:\/\/localhost/, /^http:\/\/127.0.0.1/],
-    }),
-  );
-
-  app.use('/api', apiRoute); // Root
-  app.use('/static', express.static('../public'));
-};
+const expressLoader = (app: Express) => {};
 
 export default expressLoader;
killedBy: /auth POST /register should return 200
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Survived] ObjectLiteral
src/loader/express.ts:12:10
   app.use(helmet());
   app.use(cookieParser());
   app.use(
-    cors({
-      credentials: true,
-      origin: [/^http:\/\/localhost/, /^http:\/\/127.0.0.1/],
-    }),
+    cors({}),
   );
 

[Survived] BooleanLiteral
src/loader/express.ts:13:20
   app.use(cookieParser());
   app.use(
     cors({
-      credentials: true,
+      credentials: false,
       origin: [/^http:\/\/localhost/, /^http:\/\/127.0.0.1/],
     }),

[Survived] Regex
src/loader/express.ts:14:16
   app.use(
     cors({
       credentials: true,
-      origin: [/^http:\/\/localhost/, /^http:\/\/127.0.0.1/],
+      origin: [/http:\/\/localhost/, /^http:\/\/127.0.0.1/],
     }),
   );

[Survived] StringLiteral
src/loader/express.ts:19:11
   );
 
   app.use('/api', apiRoute); // Root
-  app.use('/static', express.static('../public'));
+  app.use("", express.static('../public'));
 };
 
