[Survived] BlockStatement
src/loader/logger.ts:4:40
 import { Express } from 'express';
 import morgan from 'morgan';
 
-const loggerLoader = (app: Express) => {
-  app.use(morgan('combined'));
-  return app;
-};
+const loggerLoader = (app: Express) => {};
 
 export default loggerLoader;
