[Survived] BlockStatement
src/loader/passport.ts:4:42
 import { Express } from 'express';
 import passport from 'passport';
 
-const passportLoader = (app: Express) => {
-  app.use(passport.initialize());
-  return app;
-};
+const passportLoader = (app: Express) => {};
 
 export default passportLoader;
