[Survived] BooleanLiteral
src/model/user.ts:10:15
 const userSchema = new Schema<TUserSchema>({
   fullName: {
     type: String,
-    required: true,
+    required: false,
     trim: true,
   },

[Survived] BooleanLiteral
src/model/user.ts:11:11
   fullName: {
     type: String,
     required: true,
-    trim: true,
+    trim: false,
   },
   email: {

[Survived] BooleanLiteral
src/model/user.ts:18:13
     required: true,
     trim: true,
     match: [EMAIL_REGEX, 'Email format is invalid'],
-    unique: true,
+    unique: false,
   },
   password: {

[Survived] BooleanLiteral
src/model/user.ts:22:11
   },
   password: {
     type: String,
-    trim: true,
+    trim: false,
     required: true,
     select: false,

[Survived] BooleanLiteral
src/model/user.ts:23:15
   password: {
     type: String,
     trim: true,
-    required: true,
+    required: false,
     select: false,
   },

[Survived] BooleanLiteral
src/model/user.ts:24:13
     type: String,
     trim: true,
     required: true,
-    select: false,
+    select: true,
   },
   avatar: {
